In [1]:
d = ['Tofael', 'Nishat', 'Shiplu', 'Sayem', 'Farruk']

In [2]:
d[0:5:1] # Initialization valu, conditional value, incremental/decremenatl value

['Tofael', 'Nishat', 'Shiplu', 'Sayem', 'Farruk']

In [3]:
d[2:5:1]

['Shiplu', 'Sayem', 'Farruk']

In [4]:
d[0:5]

['Tofael', 'Nishat', 'Shiplu', 'Sayem', 'Farruk']

In [5]:
d[2:]

['Shiplu', 'Sayem', 'Farruk']

In [6]:
d[:3]

['Tofael', 'Nishat', 'Shiplu']

In [7]:
d[:5]

['Tofael', 'Nishat', 'Shiplu', 'Sayem', 'Farruk']

In [8]:
import pandas as pd

In [9]:
dName = pd.Series(['Tofael', 'Nishat', 'Shiplu', 'Sayem', 'Farruk'], index = [483, 208, 504, 308, 223])

In [10]:
dName

483    Tofael
208    Nishat
504    Shiplu
308     Sayem
223    Farruk
dtype: object

In [11]:
dName[0:5:1]

483    Tofael
208    Nishat
504    Shiplu
308     Sayem
223    Farruk
dtype: object

In [12]:
dName[2:5:1]

504    Shiplu
308     Sayem
223    Farruk
dtype: object

In [13]:
dName[2:]

504    Shiplu
308     Sayem
223    Farruk
dtype: object

In [14]:
dName[:5]

483    Tofael
208    Nishat
504    Shiplu
308     Sayem
223    Farruk
dtype: object

In [15]:
dName[-1:]

223    Farruk
dtype: object

In [16]:
dName[-1:-3:-1]

223    Farruk
308     Sayem
dtype: object

In [50]:
dName1 = pd.Series(['Tanvir ', 'Tofael K', 'Nishat S', 'Eric ', 'Shiplu R', 'Abu S', 'Farruk L'], index = [484, 483, 208, 333, 504, 308, 223])

In [51]:
dName1

484     Tanvir
483    Tofael K
208    Nishat S
333       Eric
504    Shiplu R
308       Abu S
223    Farruk L
dtype: object

In [56]:
dName2 = pd.Series(['abir', 'ultana', ' Rasel', 'ayem', 'oy', 'utful', ' Sam'], index = [483, 208, 405, 308, 504, 223, 101])

In [57]:
dName2

483      abir
208    ultana
405     Rasel
308      ayem
504        oy
223     utful
101       Sam
dtype: object

In [54]:
dName1+dName2 
# They are coming numerically
# How to solve problem of NaN

101               NaN
208    Nishat Sultana
223     Farruk Lutful
308         Abu Sayem
333               NaN
405               NaN
483      Tofael Kabir
484               NaN
504        Shiplu Roy
dtype: object

In [58]:
pd.Series.add(dName1, dName2, fill_value= 'Khan')

101          Khan Sam
208    Nishat Sultana
223     Farruk Lutful
308         Abu Sayem
333         Eric Khan
405        Khan Rasel
483      Tofael Kabir
484       Tanvir Khan
504        Shiplu Roy
dtype: object

In [32]:
#Day1 earning:
de1 = pd.Series([55, 34, 45, 23, 77, 12, 45], index = ['Tanvir H', 'Tofael K', 'Nishat S', 'Eric S', 'Shiplu R', 'Abu S', 'Farruk L'])

In [33]:
de1

Tanvir H    55
Tofael K    34
Nishat S    45
Eric S      23
Shiplu R    77
Abu S       12
Farruk L    45
dtype: int64

In [66]:
#Day2 earning:
de2 = pd.Series([75, 45, 45, 40, 53, 77, 52, 15], index = ['Tofael K', 'Nishat S', 'Eric S', 'Sam G', 'Lior Z', 'Shiplu R', 'Abu S', 'Farruk L'])

In [67]:
de2

Tofael K    75
Nishat S    45
Eric S      45
Sam G       40
Lior Z      53
Shiplu R    77
Abu S       52
Farruk L    15
dtype: int64

In [68]:
de1+de2

Abu S        64.0
Eric S       68.0
Farruk L     60.0
Lior Z        NaN
Nishat S     90.0
Sam G         NaN
Shiplu R    154.0
Tanvir H      NaN
Tofael K    109.0
dtype: float64

In [69]:
# https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.add.html
pd.Series.add(de1, de2, fill_value=None)

Abu S        64.0
Eric S       68.0
Farruk L     60.0
Lior Z        NaN
Nishat S     90.0
Sam G         NaN
Shiplu R    154.0
Tanvir H      NaN
Tofael K    109.0
dtype: float64

In [70]:
pd.Series.add(de1, de2, fill_value=0.0)

Abu S        64.0
Eric S       68.0
Farruk L     60.0
Lior Z       53.0
Nishat S     90.0
Sam G        40.0
Shiplu R    154.0
Tanvir H     55.0
Tofael K    109.0
dtype: float64

In [72]:
# https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.subtract.html
pd.Series.subtract(de2, de1, fill_value=0.0)

Abu S       40.0
Eric S      22.0
Farruk L   -30.0
Lior Z      53.0
Nishat S     0.0
Sam G       40.0
Shiplu R     0.0
Tanvir H   -55.0
Tofael K    41.0
dtype: float64

In [73]:
pd.Series.multiply(de2, de1, fill_value=1)

Abu S        624.0
Eric S      1035.0
Farruk L     675.0
Lior Z        53.0
Nishat S    2025.0
Sam G         40.0
Shiplu R    5929.0
Tanvir H      55.0
Tofael K    2550.0
dtype: float64

In [74]:
pd.Series.divide(de2, de1, fill_value=1)

Abu S        4.333333
Eric S       1.956522
Farruk L     0.333333
Lior Z      53.000000
Nishat S     1.000000
Sam G       40.000000
Shiplu R     1.000000
Tanvir H     0.018182
Tofael K     2.205882
dtype: float64

In [76]:
# df = data frame
# csv (coma separated value), excel (with space, like below), json (like dictionary) -- data type
df = pd.read_excel('1.xlsx')

In [77]:
df
# here index column is ceated

,Sample ID,ATP6V0A1,ERCC8,KAT8,SATB1,ZNF689,USP25,CLIC1,HLA-DQB1,NOD2,...,NMD3,STX4,HSD3B7,TREM1,DYRK1A,KANSL1,RAI1,ZNF668,STK39,CD33 Small
0,6160,20.242665,22.149355,22.481120,23.955208,999.00000,20.518935,15.507264,999.000000,999,...,999,20.324768,18.891624,999.000000,22.725025,21.698889,28.129703,999.000000,26.751388,999
1,6223,19.942183,999.000000,23.465341,999.000000,23.73799,22.341004,16.980441,999.000000,999,...,999,21.330324,20.356576,27.947744,22.745296,22.881539,26.825927,25.752038,25.578252,999
2,6294,26.137418,999.000000,999.000000,999.000000,999.00000,999.000000,24.198615,999.000000,999,...,999,27.028663,999.000000,999.000000,999.000000,999.000000,999.000000,999.000000,999.000000,999
3,6124,24.259192,999.000000,999.000000,999.000000,999.00000,26.168270,21.344870,27.093832,999,...,999,28.118115,22.396131,999.000000,999.000000,26.252154,999.000000,999.000000,999.000000,999
4,6369,22.692935,999.000000,25.304070,999.000000,999.00000,27.527350,19.484585,999.000000,999,...,999,24.923577,22.693445,26.914716,999.000000,24.281761,27.496376,999.000000,26.880991,999

In [78]:
df.shape # determine the size of row and column

(5, 97)

In [79]:
df.columns # All the column will be printed

Index(['Sample ID', 'ATP6V0A1', 'ERCC8', 'KAT8', 'SATB1', 'ZNF689', 'USP25',
       'CLIC1', 'HLA-DQB1', 'NOD2', 'SYT11', 'INPP5F', 'CD14', 'BAG3', 'GALC',
       'KPNA1', 'SCARB2', 'ALAS1', 'VAMP4', 'CNOT1', 'HSPA1A', 'PAM', 'TIAL1',
       'LRRC37A2', 'HLA-DRA', 'BAG6', 'GAPDH', 'LAT', 'SIPA1L2', 'ARHGAP27',
       'TMEM175', 'CSNK2B', 'IL1R2', 'PARP9', 'TOM1L2', 'LRRC37A4P',
       'HLA-DRB1', 'BCKDK', 'GBA', 'LMNA', 'SNCA', 'ARL17A', 'VKORC1L1',
       'CYLD', 'ITGAM', 'POLR2A', 'TRIM26', 'MCCC1', 'FYN', 'CAMK2D', 'GPNMB',
       'LRRC37A', 'SORBS3', 'BST1', 'ZNF184', 'DDRGK1', 'ITGAX', 'PRKAR2A',
       'USP19', 'NCKIPSD', 'FCGR2A', 'CCAR2', 'GTF2H3', 'LRRK2', 'SREBF1',
       'GAK', 'NFKB2', 'DGKQ', 'ITPA', 'RAB7L1', 'VKORC1', 'RILPL2', 'CTSB',
       'CDK2AP1', 'HLA-DQA1', 'NCKIPSD.1', 'STBD1', 'HLA-DRB5', 'NUPL2',
       'DTX3L', 'ITPKB', 'RABGEF1', 'VPS13C', 'SPPL2B', 'CD33 Large', 'CHMP2B',
       'HLA-DQA2', 'NMD3', 'STX4', 'HSD3B7', 'TREM1', 'DYRK1A', 'KANSL1',
       'RAI1', 'ZNF668', 'STK39', 'CD33 Small'],
      dtype='object')

In [80]:
df.columns[5] # to know about a specific column

'ZNF689'

In [83]:
# There is some value we need to exclude, those came through machine
# https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.read_excel.html
df2 = pd.read_excel('1.xlsx', index_col='Sample ID')

In [84]:
df2
#Here Sample ID become the index column

,ATP6V0A1,ERCC8,KAT8,SATB1,ZNF689,USP25,CLIC1,HLA-DQB1,NOD2,SYT11,...,NMD3,STX4,HSD3B7,TREM1,DYRK1A,KANSL1,RAI1,ZNF668,STK39,CD33 Small
Sample ID,,,,,,,,,,,,,,,,,,,,,
6160,20.242665,22.149355,22.481120,23.955208,999.00000,20.518935,15.507264,999.000000,999,999.000000,...,999,20.324768,18.891624,999.000000,22.725025,21.698889,28.129703,999.000000,26.751388,999
6223,19.942183,999.000000,23.465341,999.000000,23.73799,22.341004,16.980441,999.000000,999,24.733509,...,999,21.330324,20.356576,27.947744,22.745296,22.881539,26.825927,25.752038,25.578252,999
6294,26.137418,999.000000,999.000000,999.000000,999.00000,999.000000,24.198615,999.000000,999,999.000000,...,999,27.028663,999.000000,999.000000,999.000000,999.000000,999.000000,999.000000,999.000000,999
6124,24.259192,999.000000,999.000000,999.000000,999.00000,26.168270,21.344870,27.093832,999,999.000000,...,999,28.118115,22.396131,999.000000,999.000000,26.252154,999.000000,999.000000,999.000000,999
6369,22.692935,999.000000,25.304070,999.000000,999.00000,27.527350,19.484585,999.000000,999,999.000000,...,999,24.923577,22.693445,26.914716,999.000000,24.281761,27.496376,999.000000,26.880991,999

In [88]:
#see 2.xlsx which have unnecessary data on first 4 rows, so we have to use header to avoid them
# if there is no space on top to remove then can use header = 0
df3 = pd.read_excel('2.xlsx', index_col='Sample ID', header = 4)

In [89]:
df3

,ATP6V0A1,ERCC8,KAT8,SATB1,ZNF689,USP25,CLIC1,HLA-DQB1,NOD2,SYT11,INPP5F,CD14,BAG3,GALC,KPNA1,SCARB2,ALAS1,VAMP4
Sample ID,,,,,,,,,,,,,,,,,,
6160,20.242665,22.149355,22.481120,23.955208,999.00000,20.518935,15.507264,999.000000,999,999.000000,999,23.164132,22.029404,23.141682,21.752198,19.663770,20.328364,22.710356
6223,19.942183,999.000000,23.465341,999.000000,23.73799,22.341004,16.980441,999.000000,999,24.733509,999,19.049272,23.869967,27.244976,23.233811,20.416863,21.092358,24.399914
6294,26.137418,999.000000,999.000000,999.000000,999.00000,999.000000,24.198615,999.000000,999,999.000000,999,999.000000,999.000000,999.000000,999.000000,27.988659,26.728114,999.000000
6124,24.259192,999.000000,999.000000,999.000000,999.00000,26.168270,21.344870,27.093832,999,999.000000,999,999.000000,27.687824,27.401336,999.000000,22.965413,24.681684,24.235368
6369,22.692935,999.000000,25.304070,999.000000,999.00000,27.527350,19.484585,999.000000,999,999.000000,999,24.807826,26.813003,24.584745,25.163668,23.515037,23.338091,24.687817

In [93]:
# if all the cloumns are not necessary to analyze
# header=0 is used
# Sampele ID must be present in useclos
df4 = pd.read_excel('1.xlsx', index_col='Sample ID', header=0, usecols=['Sample ID','ATP6V0A1','SATB1', 'USP25', 'CLIC1'])

In [94]:
df4

            ATP6V0A1       SATB1       USP25      CLIC1
Sample ID
6160       20.242665   23.955208   20.518935  15.507264
6223       19.942183  999.000000   22.341004  16.980441
6294       26.137418  999.000000  999.000000  24.198615
6124       24.259192  999.000000   26.168270  21.344870
6369       22.692935  999.000000   27.527350  19.484585

In [95]:
#if I need to take 40 cloumns whihc is difficult to type. then what to do
df5 = pd.read_excel('1.xlsx')

In [97]:
col = df5.columns

In [98]:
col

Index(['Sample ID', 'ATP6V0A1', 'ERCC8', 'KAT8', 'SATB1', 'ZNF689', 'USP25',
       'CLIC1', 'HLA-DQB1', 'NOD2', 'SYT11', 'INPP5F', 'CD14', 'BAG3', 'GALC',
       'KPNA1', 'SCARB2', 'ALAS1', 'VAMP4', 'CNOT1', 'HSPA1A', 'PAM', 'TIAL1',
       'LRRC37A2', 'HLA-DRA', 'BAG6', 'GAPDH', 'LAT', 'SIPA1L2', 'ARHGAP27',
       'TMEM175', 'CSNK2B', 'IL1R2', 'PARP9', 'TOM1L2', 'LRRC37A4P',
       'HLA-DRB1', 'BCKDK', 'GBA', 'LMNA', 'SNCA', 'ARL17A', 'VKORC1L1',
       'CYLD', 'ITGAM', 'POLR2A', 'TRIM26', 'MCCC1', 'FYN', 'CAMK2D', 'GPNMB',
       'LRRC37A', 'SORBS3', 'BST1', 'ZNF184', 'DDRGK1', 'ITGAX', 'PRKAR2A',
       'USP19', 'NCKIPSD', 'FCGR2A', 'CCAR2', 'GTF2H3', 'LRRK2', 'SREBF1',
       'GAK', 'NFKB2', 'DGKQ', 'ITPA', 'RAB7L1', 'VKORC1', 'RILPL2', 'CTSB',
       'CDK2AP1', 'HLA-DQA1', 'NCKIPSD.1', 'STBD1', 'HLA-DRB5', 'NUPL2',
       'DTX3L', 'ITPKB', 'RABGEF1', 'VPS13C', 'SPPL2B', 'CD33 Large', 'CHMP2B',
       'HLA-DQA2', 'NMD3', 'STX4', 'HSD3B7', 'TREM1', 'DYRK1A', 'KANSL1',
       'RAI1', 'ZNF668', 'STK39', 'CD33 Small'],
      dtype='object')

In [99]:
my_col= col[0:45]

In [102]:
my_col

Index(['Sample ID', 'ATP6V0A1', 'ERCC8', 'KAT8', 'SATB1', 'ZNF689', 'USP25',
       'CLIC1', 'HLA-DQB1', 'NOD2', 'SYT11', 'INPP5F', 'CD14', 'BAG3', 'GALC',
       'KPNA1', 'SCARB2', 'ALAS1', 'VAMP4', 'CNOT1', 'HSPA1A', 'PAM', 'TIAL1',
       'LRRC37A2', 'HLA-DRA', 'BAG6', 'GAPDH', 'LAT', 'SIPA1L2', 'ARHGAP27',
       'TMEM175', 'CSNK2B', 'IL1R2', 'PARP9', 'TOM1L2', 'LRRC37A4P',
       'HLA-DRB1', 'BCKDK', 'GBA', 'LMNA', 'SNCA', 'ARL17A', 'VKORC1L1',
       'CYLD', 'ITGAM'],
      dtype='object')

In [105]:
df6 = pd.read_excel('1.xlsx', index_col='Sample ID', header=0, usecols=my_col)

In [106]:
df6

,ATP6V0A1,ERCC8,KAT8,SATB1,ZNF689,USP25,CLIC1,HLA-DQB1,NOD2,SYT11,...,LRRC37A4P,HLA-DRB1,BCKDK,GBA,LMNA,SNCA,ARL17A,VKORC1L1,CYLD,ITGAM
Sample ID,,,,,,,,,,,,,,,,,,,,,
6160,20.242665,22.149355,22.481120,23.955208,999.00000,20.518935,15.507264,999.000000,999,999.000000,...,999,19.287314,19.558290,18.078767,17.442708,19.600444,24.578219,24.555691,22.372868,19.276714
6223,19.942183,999.000000,23.465341,999.000000,23.73799,22.341004,16.980441,999.000000,999,24.733509,...,999,17.373892,20.204666,19.955245,18.956920,20.923120,24.185184,24.725951,22.483926,21.008445
6294,26.137418,999.000000,999.000000,999.000000,999.00000,999.000000,24.198615,999.000000,999,999.000000,...,999,999.000000,999.000000,999.000000,999.000000,999.000000,26.401332,999.000000,999.000000,999.000000
6124,24.259192,999.000000,999.000000,999.000000,999.00000,26.168270,21.344870,27.093832,999,999.000000,...,999,22.252675,23.434359,23.204965,23.256497,999.000000,999.000000,999.000000,999.000000,24.371282
6369,22.692935,999.000000,25.304070,999.000000,999.00000,27.527350,19.484585,999.000000,999,999.000000,...,999,19.917700,22.394269,22.252705,21.558285,23.920612,27.458156,26.761680,25.870632,24.061691

In [108]:
df7 = pd.read_excel('1.xlsx', index_col='Sample ID', header=0, usecols=my_col[0:10:1])

In [109]:
df7

,ATP6V0A1,ERCC8,KAT8,SATB1,ZNF689,USP25,CLIC1,HLA-DQB1,NOD2
Sample ID,,,,,,,,,
6160,20.242665,22.149355,22.481120,23.955208,999.00000,20.518935,15.507264,999.000000,999
6223,19.942183,999.000000,23.465341,999.000000,23.73799,22.341004,16.980441,999.000000,999
6294,26.137418,999.000000,999.000000,999.000000,999.00000,999.000000,24.198615,999.000000,999
6124,24.259192,999.000000,999.000000,999.000000,999.00000,26.168270,21.344870,27.093832,999
6369,22.692935,999.000000,25.304070,999.000000,999.00000,27.527350,19.484585,999.000000,999

In [110]:
df8 = pd.read_excel('1.xlsx', index_col='Sample ID', header=0, usecols=my_col[0:10:2])

In [111]:
df8

                ERCC8       SATB1       USP25    HLA-DQB1
Sample ID
6160        22.149355   23.955208   20.518935  999.000000
6223       999.000000  999.000000   22.341004  999.000000
6294       999.000000  999.000000  999.000000  999.000000
6124       999.000000  999.000000   26.168270   27.093832
6369       999.000000  999.000000   27.527350  999.000000

In [112]:
type(my_col)  # index type object, not a list

pandas.core.indexes.base.Index

In [113]:
df9 = pd.read_excel('1.xlsx', index_col='Sample ID', header=0, usecols=my_col[0:10:2], na_values = 999.0)
# how to avoid a null value

In [114]:
df9

               ERCC8      SATB1      USP25   HLA-DQB1
Sample ID
6160       22.149355  23.955208  20.518935        NaN
6223             NaN        NaN  22.341004        NaN
6294             NaN        NaN        NaN        NaN
6124             NaN        NaN  26.168270  27.093832
6369             NaN        NaN  27.527350        NaN

In [120]:
df10 = pd.read_excel('1.xlsx', index_col='Sample ID', header=0, usecols=my_col, na_values=999.0)
# how to avoid int value 999 from df10? we removed from float, don't know. it was a homework

In [121]:
df10

,ATP6V0A1,ERCC8,KAT8,SATB1,ZNF689,USP25,CLIC1,HLA-DQB1,NOD2,SYT11,...,LRRC37A4P,HLA-DRB1,BCKDK,GBA,LMNA,SNCA,ARL17A,VKORC1L1,CYLD,ITGAM
Sample ID,,,,,,,,,,,,,,,,,,,,,
6160,20.242665,22.149355,22.481120,23.955208,NaN,20.518935,15.507264,NaN,999,NaN,...,999,19.287314,19.558290,18.078767,17.442708,19.600444,24.578219,24.555691,22.372868,19.276714
6223,19.942183,NaN,23.465341,NaN,23.73799,22.341004,16.980441,NaN,999,24.733509,...,999,17.373892,20.204666,19.955245,18.956920,20.923120,24.185184,24.725951,22.483926,21.008445
6294,26.137418,NaN,NaN,NaN,NaN,NaN,24.198615,NaN,999,NaN,...,999,NaN,NaN,NaN,NaN,NaN,26.401332,NaN,NaN,NaN
6124,24.259192,NaN,NaN,NaN,NaN,26.168270,21.344870,27.093832,999,NaN,...,999,22.252675,23.434359,23.204965,23.256497,NaN,NaN,NaN,NaN,24.371282
6369,22.692935,NaN,25.304070,NaN,NaN,27.527350,19.484585,NaN,999,NaN,...,999,19.917700,22.394269,22.252705,21.558285,23.920612,27.458156,26.761680,25.870632,24.061691

In [122]:
my_col= col[0:45]

In [123]:
my_col

Index(['Sample ID', 'ATP6V0A1', 'ERCC8', 'KAT8', 'SATB1', 'ZNF689', 'USP25',
       'CLIC1', 'HLA-DQB1', 'NOD2', 'SYT11', 'INPP5F', 'CD14', 'BAG3', 'GALC',
       'KPNA1', 'SCARB2', 'ALAS1', 'VAMP4', 'CNOT1', 'HSPA1A', 'PAM', 'TIAL1',
       'LRRC37A2', 'HLA-DRA', 'BAG6', 'GAPDH', 'LAT', 'SIPA1L2', 'ARHGAP27',
       'TMEM175', 'CSNK2B', 'IL1R2', 'PARP9', 'TOM1L2', 'LRRC37A4P',
       'HLA-DRB1', 'BCKDK', 'GBA', 'LMNA', 'SNCA', 'ARL17A', 'VKORC1L1',
       'CYLD', 'ITGAM'],
      dtype='object')